[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:14:1
 var builder = WebApplication.CreateBuilder(args);
 
 // AGREGAR: Cargar variables de entorno
-Env.Load();
+;
 
 // AGREGAR: Configurar variables de entorno en builder

[Survived] String mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:19:77
 // AGREGAR: Configurar variables de entorno en builder
 builder.Configuration["Authentication:Google:ClientId"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_ID");
 builder.Configuration["Authentication:Google:ClientSecret"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_SECRET");
-builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("");
 
 // Add services to the container.

[NoCoverage] String mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:30:47
 builder.Services.AddApplicationInsightsTelemetry(options =>
 {
     options.ConnectionString = builder.Configuration.GetConnectionString("ApplicationInsights") 
-        ?? Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING");
+        ?? Environment.GetEnvironmentVariable("");
 });
 

[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:37:1
 builder.Services.AddSingleton<TelemetryClient>();
 
 // Registrar MetricsService
-builder.Services.AddScoped<IMetricsService, MetricsService>();
+;
 
 // CORS - MOVER ANTES DE OTROS SERVICIOS
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_HomeEndpoint_ReturnsSuccessAndCorrectContentType; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsNotFoundForInvalidId; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsSuccessForValidId

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:40:1
 builder.Services.AddScoped<IMetricsService, MetricsService>();
 
 // CORS - MOVER ANTES DE OTROS SERVICIOS
-builder.Services.AddCors(options =>
-{
-    options.AddPolicy("AllowAll",
-        builder =>
-        {
-            builder
-                .AllowAnyOrigin()
-                .AllowAnyMethod()
-                .AllowAnyHeader();
-        });
-});
+;
 
 // HttpClient

[Survived] Null coalescing mutation (left to right)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:56:24
 builder.Services.AddHttpClient();
 
 // Database context
-var connectionString = builder.Configuration.GetConnectionString("DefaultConnection") 
-    ?? Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
+var connectionString = Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING")    ?? builder.Configuration.GetConnectionString("DefaultConnection");
 
 builder.Services.AddDbContext<ApplicationDbContext>(options =>

[Survived] Null coalescing mutation (remove left)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:63:14
     options.UseMySql(connectionString, ServerVersion.AutoDetect(connectionString)));
 
 // JWT Authentication - CORREGIR CONFIGURACIÓN
-var jwtKey = builder.Configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+var jwtKey = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
 var issuer = builder.Configuration["JWT:Issuer"];
 var audience = builder.Configuration["JWT:Audience"];

[Survived] Null coalescing mutation (remove right)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:63:14
     options.UseMySql(connectionString, ServerVersion.AutoDetect(connectionString)));
 
 // JWT Authentication - CORREGIR CONFIGURACIÓN
-var jwtKey = builder.Configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+var jwtKey = builder.Configuration["JWT:SecretKey"];
 var issuer = builder.Configuration["JWT:Issuer"];
 var audience = builder.Configuration["JWT:Audience"];

[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:68:1
 var audience = builder.Configuration["JWT:Audience"];
 var key = Encoding.UTF8.GetBytes(jwtKey); // CAMBIAR A UTF8
 
-builder.Services.AddAuthentication(options =>
-{
-    options.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-    options.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-})
-.AddJwtBearer(options =>
-{
-    options.RequireHttpsMetadata = false;
-    options.SaveToken = true;
-    options.TokenValidationParameters = new TokenValidationParameters
-    {
-        ValidateIssuer = true,          // CAMBIAR A true
-        ValidateAudience = true,        // CAMBIAR A true
-        ValidateLifetime = true,        // AGREGAR
-        ValidateIssuerSigningKey = true,
-        ValidIssuer = issuer,           // AGREGAR
-        ValidAudience = audience,       // AGREGAR
-        IssuerSigningKey = new SymmetricSecurityKey(key)
-    };
-});
+;
 
 // AGREGAR: Autorización explícita
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_ValidateToken_ReturnsUnauthorizedWithoutToken

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:75:36
 })
 .AddJwtBearer(options =>
 {
-    options.RequireHttpsMetadata = false;
+    options.RequireHttpsMetadata = true;
     options.SaveToken = true;
     options.TokenValidationParameters = new TokenValidationParameters

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:76:25
 .AddJwtBearer(options =>
 {
     options.RequireHttpsMetadata = false;
-    options.SaveToken = true;
+    options.SaveToken = false;
     options.TokenValidationParameters = new TokenValidationParameters
     {

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:79:26
     options.SaveToken = true;
     options.TokenValidationParameters = new TokenValidationParameters
     {
-        ValidateIssuer = true,          // CAMBIAR A true
+        ValidateIssuer = false,          // CAMBIAR A true
         ValidateAudience = true,        // CAMBIAR A true
         ValidateLifetime = true,        // AGREGAR

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:80:28
     options.TokenValidationParameters = new TokenValidationParameters
     {
         ValidateIssuer = true,          // CAMBIAR A true
-        ValidateAudience = true,        // CAMBIAR A true
+        ValidateAudience = false,        // CAMBIAR A true
         ValidateLifetime = true,        // AGREGAR
         ValidateIssuerSigningKey = true,

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:81:28
     {
         ValidateIssuer = true,          // CAMBIAR A true
         ValidateAudience = true,        // CAMBIAR A true
-        ValidateLifetime = true,        // AGREGAR
+        ValidateLifetime = false,        // AGREGAR
         ValidateIssuerSigningKey = true,
         ValidIssuer = issuer,           // AGREGAR

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:82:36
         ValidateIssuer = true,          // CAMBIAR A true
         ValidateAudience = true,        // CAMBIAR A true
         ValidateLifetime = true,        // AGREGAR
-        ValidateIssuerSigningKey = true,
+        ValidateIssuerSigningKey = false,
         ValidIssuer = issuer,           // AGREGAR
         ValidAudience = audience,       // AGREGAR

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:90:1
 });
 
 // AGREGAR: Autorización explícita
-builder.Services.AddAuthorization();
+;
 
 var app = builder.Build();

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:102:5
 }
 else
 {
-    app.UseExceptionHandler("/api/Home/error"); // AGREGAR manejo de errores
+    ; // AGREGAR manejo de errores
     app.UseHsts();
 }

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:103:5
 else
 {
     app.UseExceptionHandler("/api/Home/error"); // AGREGAR manejo de errores
-    app.UseHsts();
+    ;
 }
 

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:110:1
 app.UseStaticFiles();
 app.UseCors("AllowAll");
 
-app.UseRouting(); // AGREGAR ESTA LÍNEA
+; // AGREGAR ESTA LÍNEA
 
 app.UseAuthentication();

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:116:1
 app.UseAuthorization();
 
 app.MapControllers();
-app.MapFallbackToFile("index.html");
+;
 
 app.Run();
