[Killed] Block removal mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:27:9
         private readonly ILogger<MetricsService> _logger;
 
         public MetricsService(TelemetryClient telemetryClient, ILogger<MetricsService> logger)
-        {
-            _telemetryClient = telemetryClient;
-            _logger = logger;
-        }
+        {}
 
         public void TrackUserLogin(string userId, string email, string loginMethod, string semester)
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Post_AuthGoogle_ReturnsBadRequestForInvalidToken

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:38:22
             {
                 var properties = new Dictionary<string, string>
                 {
-                    ["UserId"] = userId,
+                    [""] = userId,
                     ["Email"] = email,
                     ["LoginMethod"] = loginMethod,

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:40:22
                 {
                     ["UserId"] = userId,
                     ["Email"] = email,
-                    ["LoginMethod"] = loginMethod,
+                    [""] = loginMethod,
                     ["Domain"] = email.Split('@').LastOrDefault() ?? "unknown",
                     ["Semester"] = semester,

[NoCoverage] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:41:34
                     ["UserId"] = userId,
                     ["Email"] = email,
                     ["LoginMethod"] = loginMethod,
-                    ["Domain"] = email.Split('@').LastOrDefault() ?? "unknown",
+                    ["Domain"] = "unknown",
                     ["Semester"] = semester,
                     ["Hour"] = DateTime.Now.Hour.ToString(),

[NoCoverage] Logical mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:45:38
                     ["Semester"] = semester,
                     ["Hour"] = DateTime.Now.Hour.ToString(),
                     ["DayOfWeek"] = DateTime.Now.DayOfWeek.ToString(),
-                    ["IsWeekend"] = (DateTime.Now.DayOfWeek == DayOfWeek.Saturday || DateTime.Now.DayOfWeek == DayOfWeek.Sunday).ToString()
+                    ["IsWeekend"] = (DateTime.Now.DayOfWeek == DayOfWeek.Saturday && DateTime.Now.DayOfWeek == DayOfWeek.Sunday).ToString()
                 };
 

[NoCoverage] Equality mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:45:38
                     ["Semester"] = semester,
                     ["Hour"] = DateTime.Now.Hour.ToString(),
                     ["DayOfWeek"] = DateTime.Now.DayOfWeek.ToString(),
-                    ["IsWeekend"] = (DateTime.Now.DayOfWeek == DayOfWeek.Saturday || DateTime.Now.DayOfWeek == DayOfWeek.Sunday).ToString()
+                    ["IsWeekend"] = (DateTime.Now.DayOfWeek != DayOfWeek.Saturday || DateTime.Now.DayOfWeek == DayOfWeek.Sunday).ToString()
                 };
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:48:17
                     ["IsWeekend"] = (DateTime.Now.DayOfWeek == DayOfWeek.Saturday || DateTime.Now.DayOfWeek == DayOfWeek.Sunday).ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserLogin", properties);
+                ;
                 _telemetryClient.TrackMetric("LoginSuccessCount", 1, properties);
                 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:49:17
                 };
 
                 _telemetryClient.TrackEvent("UserLogin", properties);
-                _telemetryClient.TrackMetric("LoginSuccessCount", 1, properties);
+                ;
                 
                 _logger.LogInformation($"Tracked login for user {userId}");

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:51:17
                 _telemetryClient.TrackEvent("UserLogin", properties);
                 _telemetryClient.TrackMetric("LoginSuccessCount", 1, properties);
                 
-                _logger.LogInformation($"Tracked login for user {userId}");
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:55:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking user login");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:55:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking user login");
+                _logger.LogError(ex, "");
             }
         }

[Survived] Object initializer mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:63:34
         {
             try
             {
-                var properties = new Dictionary<string, string>
-                {
-                    ["Reason"] = reason,
-                    ["LoginMethod"] = loginMethod,
-                    ["Hour"] = DateTime.Now.Hour.ToString()
-                };
+                var properties = new Dictionary<string, string>
+{};
 
                 _telemetryClient.TrackEvent("LoginFailed", properties);

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:65:22
             {
                 var properties = new Dictionary<string, string>
                 {
-                    ["Reason"] = reason,
+                    [""] = reason,
                     ["LoginMethod"] = loginMethod,
                     ["Hour"] = DateTime.Now.Hour.ToString()

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:70:17
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackEvent("LoginFailed", properties);
+                ;
                 _telemetryClient.TrackMetric("LoginFailureCount", 1, properties);
             }

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:70:45
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackEvent("LoginFailed", properties);
+                _telemetryClient.TrackEvent("", properties);
                 _telemetryClient.TrackMetric("LoginFailureCount", 1, properties);
             }

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:71:17
                 };
 
                 _telemetryClient.TrackEvent("LoginFailed", properties);
-                _telemetryClient.TrackMetric("LoginFailureCount", 1, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:75:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking login failure");
+                ;
             }
         }

[NoCoverage] Conditional (true) mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:83:33
         {
             try
             {
-                var eventName = isRegeneration ? "QRCodeRegenerated" : "QRCodeFirstGenerated";
+                var eventName = (true?"QRCodeRegenerated" :"QRCodeFirstGenerated");
                 var properties = new Dictionary<string, string>
                 {

[NoCoverage] Conditional (false) mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:83:33
         {
             try
             {
-                var eventName = isRegeneration ? "QRCodeRegenerated" : "QRCodeFirstGenerated";
+                var eventName = (false?"QRCodeRegenerated" :"QRCodeFirstGenerated");
                 var properties = new Dictionary<string, string>
                 {

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:87:22
                 var properties = new Dictionary<string, string>
                 {
                     ["UserId"] = userId,
-                    ["DNI"] = dni,
+                    [""] = dni,
                     ["Matricula"] = matricula,
                     ["IsRegeneration"] = isRegeneration.ToString(),

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:90:22
                     ["DNI"] = dni,
                     ["Matricula"] = matricula,
                     ["IsRegeneration"] = isRegeneration.ToString(),
-                    ["GenerationTime"] = generationTime.ToString(),
+                    [""] = generationTime.ToString(),
                     ["Hour"] = DateTime.Now.Hour.ToString(),
                     ["DayOfWeek"] = DateTime.Now.DayOfWeek.ToString()

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:95:17
                     ["DayOfWeek"] = DateTime.Now.DayOfWeek.ToString()
                 };
 
-                _telemetryClient.TrackEvent(eventName, properties);
+                ;
                 _telemetryClient.TrackMetric("QRGenerationTime", generationTime, properties);
                 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:96:17
                 };
 
                 _telemetryClient.TrackEvent(eventName, properties);
-                _telemetryClient.TrackMetric("QRGenerationTime", generationTime, properties);
+                ;
                 
                 if (isRegeneration)

[NoCoverage] Negate expression
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:98:21
                 _telemetryClient.TrackEvent(eventName, properties);
                 _telemetryClient.TrackMetric("QRGenerationTime", generationTime, properties);
                 
-                if (isRegeneration)
+                if (!(isRegeneration))
                 {
                     _telemetryClient.TrackMetric("QRRegenerationCount", 1, properties);

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:100:21
                 
                 if (isRegeneration)
                 {
-                    _telemetryClient.TrackMetric("QRRegenerationCount", 1, properties);
+                    ;
                 }
                 else

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:104:21
                 }
                 else
                 {
-                    _telemetryClient.TrackMetric("QRFirstGenerationCount", 1, properties);
+                    ;
                 }
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:109:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking QR generation");
+                ;
             }
         }

[NoCoverage] Object initializer mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:117:34
         {
             try
             {
-                var properties = new Dictionary<string, string>
-                {
-                    ["UserId"] = userId,
-                    ["Error"] = error
-                };
+                var properties = new Dictionary<string, string>
+{};
 
                 _telemetryClient.TrackEvent("QRGenerationFailed", properties);

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:123:17
                     ["Error"] = error
                 };
 
-                _telemetryClient.TrackEvent("QRGenerationFailed", properties);
+                ;
                 _telemetryClient.TrackMetric("QRGenerationFailureCount", 1, properties);
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:124:17
                 };
 
                 _telemetryClient.TrackEvent("QRGenerationFailed", properties);
-                _telemetryClient.TrackMetric("QRGenerationFailureCount", 1, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:128:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking QR generation failure");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:128:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking QR generation failure");
+                _logger.LogError(ex, "");
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:139:22
                 var properties = new Dictionary<string, string>
                 {
                     ["UserId"] = userId,
-                    ["Email"] = email,
+                    [""] = email,
                     ["Matricula"] = matricula,
                     ["Hour"] = DateTime.Now.Hour.ToString()

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:141:22
                     ["UserId"] = userId,
                     ["Email"] = email,
                     ["Matricula"] = matricula,
-                    ["Hour"] = DateTime.Now.Hour.ToString()
+                    [""] = DateTime.Now.Hour.ToString()
                 };
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:144:17
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserInfoViewed", properties);
+                ;
                 _telemetryClient.TrackMetric("UserInfoViewCount", 1, properties);
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:145:17
                 };
 
                 _telemetryClient.TrackEvent("UserInfoViewed", properties);
-                _telemetryClient.TrackMetric("UserInfoViewCount", 1, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:149:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking user info view");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:162:22
                     ["UserId"] = userId,
                     ["DNI"] = dni,
                     ["HistoryCount"] = recordCount.ToString(),
-                    ["Hour"] = DateTime.Now.Hour.ToString(),
+                    [""] = DateTime.Now.Hour.ToString(),
                     ["RecordsFound"] = recordCount.ToString()
                 };

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:166:17
                     ["RecordsFound"] = recordCount.ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserHistoryViewed", properties);
+                ;
                 _telemetryClient.TrackMetric("HistoryViewCount", 1, properties);
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:166:45
                     ["RecordsFound"] = recordCount.ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserHistoryViewed", properties);
+                _telemetryClient.TrackEvent("", properties);
                 _telemetryClient.TrackMetric("HistoryViewCount", 1, properties);
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:167:17
                 };
 
                 _telemetryClient.TrackEvent("UserHistoryViewed", properties);
-                _telemetryClient.TrackMetric("HistoryViewCount", 1, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:171:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking history view");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:171:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking history view");
+                _logger.LogError(ex, "");
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:184:22
                     ["UserId"] = userId,
                     ["Email"] = email,
                     ["SessionDurationMinutes"] = sessionDuration.TotalMinutes.ToString("F2"),
-                    ["Hour"] = DateTime.Now.Hour.ToString()
+                    [""] = DateTime.Now.Hour.ToString()
                 };
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:187:17
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserLogout", properties);
+                ;
                 _telemetryClient.TrackMetric("LogoutCount", 1, properties);
                 _telemetryClient.TrackMetric("SessionDuration", sessionDuration.TotalMinutes, properties);

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:187:45
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackEvent("UserLogout", properties);
+                _telemetryClient.TrackEvent("", properties);
                 _telemetryClient.TrackMetric("LogoutCount", 1, properties);
                 _telemetryClient.TrackMetric("SessionDuration", sessionDuration.TotalMinutes, properties);

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:188:17
                 };
 
                 _telemetryClient.TrackEvent("UserLogout", properties);
-                _telemetryClient.TrackMetric("LogoutCount", 1, properties);
+                ;
                 _telemetryClient.TrackMetric("SessionDuration", sessionDuration.TotalMinutes, properties);
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:189:17
 
                 _telemetryClient.TrackEvent("UserLogout", properties);
                 _telemetryClient.TrackMetric("LogoutCount", 1, properties);
-                _telemetryClient.TrackMetric("SessionDuration", sessionDuration.TotalMinutes, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:189:46
 
                 _telemetryClient.TrackEvent("UserLogout", properties);
                 _telemetryClient.TrackMetric("LogoutCount", 1, properties);
-                _telemetryClient.TrackMetric("SessionDuration", sessionDuration.TotalMinutes, properties);
+                _telemetryClient.TrackMetric("", sessionDuration.TotalMinutes, properties);
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:193:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error tracking user logout");
+                ;
             }
         }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:201:17
         {
             try
             {
-                _telemetryClient.TrackEvent(eventName, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:205:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, $"Error tracking custom event {eventName}");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:205:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, $"Error tracking custom event {eventName}");
+                _logger.LogError(ex, $"");
             }
         }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:213:17
         {
             try
             {
-                _telemetryClient.TrackMetric(metricName, value, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:217:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, $"Error tracking custom metric {metricName}");
+                ;
             }
         }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:227:22
             {
                 var properties = new Dictionary<string, string>
                 {
-                    ["Operation"] = operation,
+                    [""] = operation,
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:228:22
                 var properties = new Dictionary<string, string>
                 {
                     ["Operation"] = operation,
-                    ["Hour"] = DateTime.Now.Hour.ToString()
+                    [""] = DateTime.Now.Hour.ToString()
                 };
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:231:17
                     ["Hour"] = DateTime.Now.Hour.ToString()
                 };
 
-                _telemetryClient.TrackMetric($"{operation}Duration", durationMs, properties);
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Services/MetricsService.cs:235:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, $"Error tracking performance for {operation}");
+                ;
             }
         }
