[Killed] Block removal mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:30:9
 
         public AuthController(IConfiguration configuration, ApplicationDbContext dbContext, 
             ILogger<AuthController> logger, IHttpClientFactory httpClientFactory, IMetricsService metricsService)
-        {
-            _configuration = configuration;
-            _dbContext = dbContext;
-            _logger = logger;
-            _httpClient = httpClientFactory.CreateClient();
-            _metricsService = metricsService;
-        }
+        {}
 
         [HttpPost("google")]
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidToken_ReturnsBadRequest; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:51:21
                 var payload = await VerifyGoogleToken(request.IdToken);
                 if (payload == null)
                 {
-                    _metricsService.TrackLoginFailure("Token de Google inválido", "Google");
+                    ;
                     return BadRequest(new { error = "Token de Google inválido" });
                 }

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:58:21
                 // Verificar si el correo pertenece al dominio institucional
                 if (!payload.Email.EndsWith("@virtual.upt.pe"))
                 {
-                    _metricsService.TrackLoginFailure("Dominio no autorizado", "Google");
+                    ;
                     return BadRequest(new { error = "Solo se permite el acceso con cuentas del dominio virtual.upt.pe" });
                 }

[Killed] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:59:53
                 if (!payload.Email.EndsWith("@virtual.upt.pe"))
                 {
                     _metricsService.TrackLoginFailure("Dominio no autorizado", "Google");
-                    return BadRequest(new { error = "Solo se permite el acceso con cuentas del dominio virtual.upt.pe" });
+                    return BadRequest(new { error = "" });
                 }
 
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:67:21
 
                 if (usuario == null)
                 {
-                    _metricsService.TrackLoginFailure("Usuario no registrado", "Google");
+                    ;
                     return BadRequest(new { error = "El correo no está registrado en el sistema" });
                 }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:67:55
 
                 if (usuario == null)
                 {
-                    _metricsService.TrackLoginFailure("Usuario no registrado", "Google");
+                    _metricsService.TrackLoginFailure("", "Google");
                     return BadRequest(new { error = "El correo no está registrado en el sistema" });
                 }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:68:53
                 if (usuario == null)
                 {
                     _metricsService.TrackLoginFailure("Usuario no registrado", "Google");
-                    return BadRequest(new { error = "El correo no está registrado en el sistema" });
+                    return BadRequest(new { error = "" });
                 }
 

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:74:17
                 // Generar token JWT
                 var token = GenerarJWT(usuario);
 
-                stopwatch.Stop();
+                ;
                 
                 // Registrar métricas de login exitoso

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:77:17
                 stopwatch.Stop();
                 
                 // Registrar métricas de login exitoso
-                _metricsService.TrackUserLogin(
-                    usuario.Id_Estudiante.ToString(), 
-                    payload.Email, 
-                    "Google", 
-                    usuario.Semestre.ToString()
-                );
+                ;
                 
                 _metricsService.TrackPerformance("GoogleLogin", stopwatch.ElapsedMilliseconds);

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:84:17
                     usuario.Semestre.ToString()
                 );
                 
-                _metricsService.TrackPerformance("GoogleLogin", stopwatch.ElapsedMilliseconds);
+                ;
 
                 return Ok(new

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:84:50
                     usuario.Semestre.ToString()
                 );
                 
-                _metricsService.TrackPerformance("GoogleLogin", stopwatch.ElapsedMilliseconds);
+                _metricsService.TrackPerformance("", stopwatch.ElapsedMilliseconds);
 
                 return Ok(new

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:100:17
             }
             catch (Exception ex)
             {
-                stopwatch.Stop();
+                ;
                 _metricsService.TrackLoginFailure(ex.Message, "Google");
                 _logger.LogError(ex, "Error en la autenticación con Google");

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:101:17
             catch (Exception ex)
             {
                 stopwatch.Stop();
-                _metricsService.TrackLoginFailure(ex.Message, "Google");
+                ;
                 _logger.LogError(ex, "Error en la autenticación con Google");
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:101:63
             catch (Exception ex)
             {
                 stopwatch.Stop();
-                _metricsService.TrackLoginFailure(ex.Message, "Google");
+                _metricsService.TrackLoginFailure(ex.Message, "");
                 _logger.LogError(ex, "Error en la autenticación con Google");
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:102:17
             {
                 stopwatch.Stop();
                 _metricsService.TrackLoginFailure(ex.Message, "Google");
-                _logger.LogError(ex, "Error en la autenticación con Google");
+                ;
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:102:38
             {
                 stopwatch.Stop();
                 _metricsService.TrackLoginFailure(ex.Message, "Google");
-                _logger.LogError(ex, "Error en la autenticación con Google");
+                _logger.LogError(ex, "");
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });
             }

[Survived] Boolean mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:112:37
         public IActionResult ValidateToken()
         {
             // validación se hace automáticamente por el middleware de auth
-            return Ok(new { valid = true });
+            return Ok(new { valid = false });
         }
         

[NoCoverage] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:127:49
                 // Calcular duración de sesión (simplificado - en producción podrías almacenar el tiempo de login)
                 var sessionDuration = TimeSpan.FromMinutes(30); // Valor por defecto
                 
-                _metricsService.TrackUserLogout(userId ?? "Unknown", email ?? "Unknown", sessionDuration);
+                _metricsService.TrackUserLogout("Unknown", email ?? "Unknown", sessionDuration);
                 
                 return Ok(new { message = "Sesión cerrada exitosamente" });

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:127:17
                 // Calcular duración de sesión (simplificado - en producción podrías almacenar el tiempo de login)
                 var sessionDuration = TimeSpan.FromMinutes(30); // Valor por defecto
                 
-                _metricsService.TrackUserLogout(userId ?? "Unknown", email ?? "Unknown", sessionDuration);
+                ;
                 
                 return Ok(new { message = "Sesión cerrada exitosamente" });

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:133:50
             }
             catch (Exception ex)
             {
-                _metricsService.TrackCustomEvent("LogoutFailed", new Dictionary<string, string>
+                _metricsService.TrackCustomEvent("", new Dictionary<string, string>
                 {
                     ["Error"] = ex.Message

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:135:22
             {
                 _metricsService.TrackCustomEvent("LogoutFailed", new Dictionary<string, string>
                 {
-                    ["Error"] = ex.Message
+                    [""] = ex.Message
                 });
                 

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:152:40
 
                 if (!response.IsSuccessStatusCode)
                 {
-                    _logger.LogWarning($"Google token verification failed with status: {response.StatusCode}");
+                    _logger.LogWarning($"");
                     return null;
                 }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:169:40
                 // Verificar token fue emitido
                 if (payload.Aud != _configuration["Authentication:Google:ClientId"])
                 {
-                    _logger.LogWarning($"Token audience mismatch. Expected: {_configuration["Authentication:Google:ClientId"]}, Got: {payload.Aud}");
+                    _logger.LogWarning($"");
                     return null;
                 }

[Survived] Null coalescing mutation (left to right)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:194:17
         private string GenerarJWT(estudianteModel usuario)
         {
             var key = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(
-                _configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY")));
+                Environment.GetEnvironmentVariable("JWT_SECRET_KEY")??                 _configuration["JWT:SecretKey"]));
             var creds = new SigningCredentials(key, SecurityAlgorithms.HmacSha256);
 

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:205:40
             };
 
             var token = new JwtSecurityToken(
-                issuer: _configuration["JWT:Issuer"] ?? "pyWeb_ScaeUPT",
+                issuer: _configuration[""] ?? "pyWeb_ScaeUPT",
                 audience: _configuration["JWT:Audience"] ?? "pyWeb_ScaeUPT_Clients",
                 claims: claims,
