[Killed] Block removal mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:26:9
         private readonly string _encryptionKey = "ScaeUPT2024SecretKey123456789012345";
 
         public HomeController(ILogger<HomeController> logger, ApplicationDbContext dbContext, IMetricsService metricsService)
-        {
-            _logger = logger;
-            _dbContext = dbContext;
-            _metricsService = metricsService;
-        }
+        {}
 
         [HttpGet]
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetEstudiante_ExistingId_ReturnsOk; pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk; pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetUserInfo_ValidUser_ReturnsOk

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:35:39
         [HttpGet]
         public IActionResult Get()
         {
-            return Ok(new { message = "API funcionando correctamente" });
+            return Ok(new { message = "" });
         }
 

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:80:17
                 stopwatch.Stop();
                 
                 // Registrar métricas
-                _metricsService.TrackUserInfoView(id.ToString(), email, estudiante.Matricula);
+                ;
                 _metricsService.TrackPerformance("GetUserInfo", stopwatch.ElapsedMilliseconds);
 

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:81:17
                 
                 // Registrar métricas
                 _metricsService.TrackUserInfoView(id.ToString(), email, estudiante.Matricula);
-                _metricsService.TrackPerformance("GetUserInfo", stopwatch.ElapsedMilliseconds);
+                ;
 
                 return Ok(userInfo);

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:81:50
                 
                 // Registrar métricas
                 _metricsService.TrackUserInfoView(id.ToString(), email, estudiante.Matricula);
-                _metricsService.TrackPerformance("GetUserInfo", stopwatch.ElapsedMilliseconds);
+                _metricsService.TrackPerformance("", stopwatch.ElapsedMilliseconds);
 
                 return Ok(userInfo);

[NoCoverage] Object initializer mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:88:72
             catch (Exception ex)
             {
                 stopwatch.Stop();
-                _metricsService.TrackCustomEvent("UserInfoViewFailed", new Dictionary<string, string>
-                {
-                    ["Error"] = ex.Message
-                });
+                _metricsService.TrackCustomEvent("UserInfoViewFailed", new Dictionary<string, string>
+{});
                 
                 _logger.LogError(ex, "Error al obtener información del usuario");

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:93:17
                     ["Error"] = ex.Message
                 });
                 
-                _logger.LogError(ex, "Error al obtener información del usuario");
+                ;
                 return StatusCode(500, "Error interno del servidor");
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:93:38
                     ["Error"] = ex.Message
                 });
                 
-                _logger.LogError(ex, "Error al obtener información del usuario");
+                _logger.LogError(ex, "");
                 return StatusCode(500, "Error interno del servidor");
             }

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:122:74
                 string dniToEncrypt = estudiante.Id_Persona;
 
                 // Verificar si es regeneración
-                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
+                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token != dniToEncrypt);
                 bool isRegeneration = existingToken != null;
 

[Killed] Linq method mutation (FirstOrDefault() to First())
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:122:37
                 string dniToEncrypt = estudiante.Id_Persona;
 
                 // Verificar si es regeneración
-                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
+                var existingToken = _dbContext.token.First(t => t.DNI_token == dniToEncrypt);
                 bool isRegeneration = existingToken != null;
 
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk

[Survived] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:123:39
 
                 // Verificar si es regeneración
                 var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
-                bool isRegeneration = existingToken != null;
+                bool isRegeneration = existingToken == null;
 
                 // Generar timestamp con mayor precisión y GUID único

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:149:21
                 string encryptedToken = EncryptData(dataToEncrypt);
 
                 // Crear o actualizar el registro en la tabla de tokens
-                if (existingToken != null)
+                if (existingToken == null)
                 {
                     // Actualizar token existente
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:171:17
                 stopwatch.Stop();
                 
                 // Registrar métricas
-                _metricsService.TrackQRGeneration(
-                    id.ToString(), 
-                    dniToEncrypt, 
-                    estudiante.Matricula, 
-                    isRegeneration, 
-                    stopwatch.ElapsedMilliseconds
-                );
+                ;
 
                 return Ok(new { 

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:181:51
 
                 return Ok(new { 
                     success = true, 
-                    timestamp = limaTime.ToString("dd/MM/yyyy HH:mm:ss"),
+                    timestamp = limaTime.ToString(""),
                     qrData = encryptedToken,
                     qrCodeBase64 = qrCodeBase64

[NoCoverage] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:189:58
             catch (Exception ex)
             {
                 stopwatch.Stop();
-                _metricsService.TrackQRGenerationFailure(userId ?? "Unknown", ex.Message);
+                _metricsService.TrackQRGenerationFailure("Unknown", ex.Message);
                 _logger.LogError(ex, "Error al generar código QR");
                 return StatusCode(500, "Error interno del servidor");

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:189:17
             catch (Exception ex)
             {
                 stopwatch.Stop();
-                _metricsService.TrackQRGenerationFailure(userId ?? "Unknown", ex.Message);
+                ;
                 _logger.LogError(ex, "Error al generar código QR");
                 return StatusCode(500, "Error interno del servidor");

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:190:17
             {
                 stopwatch.Stop();
                 _metricsService.TrackQRGenerationFailure(userId ?? "Unknown", ex.Message);
-                _logger.LogError(ex, "Error al generar código QR");
+                ;
                 return StatusCode(500, "Error interno del servidor");
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:190:38
             {
                 stopwatch.Stop();
                 _metricsService.TrackQRGenerationFailure(userId ?? "Unknown", ex.Message);
-                _logger.LogError(ex, "Error al generar código QR");
+                _logger.LogError(ex, "");
                 return StatusCode(500, "Error interno del servidor");
             }

[NoCoverage] Linq method mutation (Take() to Skip())
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:213:30
                 if (estudiante == null) return NotFound("Estudiante no encontrado");
 
                 // Obtener historial de tokens del usuario
-                var tokens = _dbContext.token
-                    .Where(t => t.DNI_token == estudiante.Id_Persona)
-                    .OrderByDescending(t => t.Id_codigoqr)
-                    .Take(10) // Últimos 10 registros
+                var tokens = _dbContext.token
+                    .Where(t => t.DNI_token == estudiante.Id_Persona)
+                    .OrderByDescending(t => t.Id_codigoqr)
+                    .Skip(10) // Últimos 10 registros
                     .ToList();
 

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:213:30
                 if (estudiante == null) return NotFound("Estudiante no encontrado");
 
                 // Obtener historial de tokens del usuario
-                var tokens = _dbContext.token
-                    .Where(t => t.DNI_token == estudiante.Id_Persona)
-                    .OrderByDescending(t => t.Id_codigoqr)
+                var tokens = _dbContext.token
+                    .Where(t => t.DNI_token == estudiante.Id_Persona)
+                    .OrderBy(t => t.Id_codigoqr)
                     .Take(10) // Últimos 10 registros
                     .ToList();

[NoCoverage] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:214:33
 
                 // Obtener historial de tokens del usuario
                 var tokens = _dbContext.token
-                    .Where(t => t.DNI_token == estudiante.Id_Persona)
+                    .Where(t => t.DNI_token != estudiante.Id_Persona)
                     .OrderByDescending(t => t.Id_codigoqr)
                     .Take(10) // Últimos 10 registros

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:222:17
                 stopwatch.Stop();
                 
                 // Registrar métricas
-                _metricsService.TrackUserHistoryView(id.ToString(), estudiante.Id_Persona, tokens.Count);
+                ;
                 _metricsService.TrackPerformance("GetUserHistory", stopwatch.ElapsedMilliseconds);
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:223:17
                 
                 // Registrar métricas
                 _metricsService.TrackUserHistoryView(id.ToString(), estudiante.Id_Persona, tokens.Count);
-                _metricsService.TrackPerformance("GetUserHistory", stopwatch.ElapsedMilliseconds);
+                ;
 
                 return Ok(new { history = tokens, count = tokens.Count });

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:235:17
                     ["Error"] = ex.Message
                 });
                 
-                _logger.LogError(ex, "Error al obtener historial del usuario");
+                ;
                 return StatusCode(500, "Error interno del servidor");
             }
