[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:13:1
 var builder = WebApplication.CreateBuilder(args);
 
 // Add services to the container.
-builder.Services.AddControllers();
+;
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddSwaggerGen();
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_HomeEndpoint_ReturnsSuccessAndCorrectContentType; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsNotFoundForInvalidId; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsSuccessForValidId

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:18:1
 builder.Services.AddSwaggerGen();
 
 // Application Insights
-builder.Services.AddApplicationInsightsTelemetry(options =>
-{
-    options.ConnectionString = builder.Configuration.GetConnectionString("ApplicationInsights") 
-        ?? Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING");
-});
+;
 
 // Registrar TelemetryClient como singleton

[Survived] Null coalescing mutation (left to right)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:20:32
 // Application Insights
 builder.Services.AddApplicationInsightsTelemetry(options =>
 {
-    options.ConnectionString = builder.Configuration.GetConnectionString("ApplicationInsights") 
-        ?? Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING");
+    options.ConnectionString = Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING")        ?? builder.Configuration.GetConnectionString("ApplicationInsights");
 });
 

[Survived] Null coalescing mutation (remove left)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:20:32
 // Application Insights
 builder.Services.AddApplicationInsightsTelemetry(options =>
 {
-    options.ConnectionString = builder.Configuration.GetConnectionString("ApplicationInsights") 
-        ?? Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING");
+    options.ConnectionString = Environment.GetEnvironmentVariable("APPLICATIONINSIGHTS_CONNECTION_STRING");
 });
 

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:25:1
 });
 
 // Registrar TelemetryClient como singleton
-builder.Services.AddSingleton<TelemetryClient>();
+;
 
 // Registrar MetricsService - AGREGAR ESTA LÍNEA

[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:28:1
 builder.Services.AddSingleton<TelemetryClient>();
 
 // Registrar MetricsService - AGREGAR ESTA LÍNEA
-builder.Services.AddScoped<IMetricsService, MetricsService>();
+;
 
 // Database context
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_HomeEndpoint_ReturnsSuccessAndCorrectContentType; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsNotFoundForInvalidId; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsSuccessForValidId

[Survived] Null coalescing mutation (remove left)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:31:24
 builder.Services.AddScoped<IMetricsService, MetricsService>();
 
 // Database context
-var connectionString = builder.Configuration.GetConnectionString("DefaultConnection") 
-    ?? Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
+var connectionString = Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
 
 builder.Services.AddDbContext<ApplicationDbContext>(options =>

[Survived] Null coalescing mutation (remove right)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:31:24
 builder.Services.AddScoped<IMetricsService, MetricsService>();
 
 // Database context
-var connectionString = builder.Configuration.GetConnectionString("DefaultConnection") 
-    ?? Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
+var connectionString = builder.Configuration.GetConnectionString("DefaultConnection");
 
 builder.Services.AddDbContext<ApplicationDbContext>(options =>

[Survived] String mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:32:43
 
 // Database context
 var connectionString = builder.Configuration.GetConnectionString("DefaultConnection") 
-    ?? Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
+    ?? Environment.GetEnvironmentVariable("");
 
 builder.Services.AddDbContext<ApplicationDbContext>(options =>

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:34:1
 var connectionString = builder.Configuration.GetConnectionString("DefaultConnection") 
     ?? Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING");
 
-builder.Services.AddDbContext<ApplicationDbContext>(options =>
-    options.UseMySql(connectionString, ServerVersion.AutoDetect(connectionString)));
+;
 
 // JWT Authentication

[Survived] Null coalescing mutation (remove left)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:38:14
     options.UseMySql(connectionString, ServerVersion.AutoDetect(connectionString)));
 
 // JWT Authentication
-var jwtKey = builder.Configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+var jwtKey = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
 var key = Encoding.ASCII.GetBytes(jwtKey);
 

[Survived] Null coalescing mutation (remove right)
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:38:14
     options.UseMySql(connectionString, ServerVersion.AutoDetect(connectionString)));
 
 // JWT Authentication
-var jwtKey = builder.Configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+var jwtKey = builder.Configuration["JWT:SecretKey"];
 var key = Encoding.ASCII.GetBytes(jwtKey);
 

[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:41:1
 var jwtKey = builder.Configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
 var key = Encoding.ASCII.GetBytes(jwtKey);
 
-builder.Services.AddAuthentication(x =>
-{
-    x.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-    x.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-})
-.AddJwtBearer(x =>
-{
-    x.RequireHttpsMetadata = false;
-    x.SaveToken = true;
-    x.TokenValidationParameters = new TokenValidationParameters
-    {
-        ValidateIssuerSigningKey = true,
-        IssuerSigningKey = new SymmetricSecurityKey(key),
-        ValidateIssuer = false,
-        ValidateAudience = false
-    };
-});
+;
 
 // CORS
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_ValidateToken_ReturnsUnauthorizedWithoutToken

[Survived] Block removal mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:42:1
 var key = Encoding.ASCII.GetBytes(jwtKey);
 
 builder.Services.AddAuthentication(x =>
-{
-    x.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-    x.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-})
+{})
 .AddJwtBearer(x =>
 {

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:48:30
 })
 .AddJwtBearer(x =>
 {
-    x.RequireHttpsMetadata = false;
+    x.RequireHttpsMetadata = true;
     x.SaveToken = true;
     x.TokenValidationParameters = new TokenValidationParameters

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:49:19
 .AddJwtBearer(x =>
 {
     x.RequireHttpsMetadata = false;
-    x.SaveToken = true;
+    x.SaveToken = false;
     x.TokenValidationParameters = new TokenValidationParameters
     {

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:52:36
     x.SaveToken = true;
     x.TokenValidationParameters = new TokenValidationParameters
     {
-        ValidateIssuerSigningKey = true,
+        ValidateIssuerSigningKey = false,
         IssuerSigningKey = new SymmetricSecurityKey(key),
         ValidateIssuer = false,

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:54:26
     {
         ValidateIssuerSigningKey = true,
         IssuerSigningKey = new SymmetricSecurityKey(key),
-        ValidateIssuer = false,
+        ValidateIssuer = true,
         ValidateAudience = false
     };

[Survived] Boolean mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:55:28
         ValidateIssuerSigningKey = true,
         IssuerSigningKey = new SymmetricSecurityKey(key),
         ValidateIssuer = false,
-        ValidateAudience = false
+        ValidateAudience = true
     };
 });

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:60:1
 });
 
 // CORS
-builder.Services.AddCors(options =>
-{
-    options.AddPolicy("AllowAll",
-        builder =>
-        {
-            builder
-                .AllowAnyOrigin()
-                .AllowAnyMethod()
-                .AllowAnyHeader();
-        });
-});
+;
 
 // HttpClient

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:62:5
 // CORS
 builder.Services.AddCors(options =>
 {
-    options.AddPolicy("AllowAll",
-        builder =>
-        {
-            builder
-                .AllowAnyOrigin()
-                .AllowAnyMethod()
-                .AllowAnyHeader();
-        });
+    ;
 });
 

[Survived] String mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:62:23
 // CORS
 builder.Services.AddCors(options =>
 {
-    options.AddPolicy("AllowAll",
+    options.AddPolicy("",
         builder =>
         {

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:65:13
     options.AddPolicy("AllowAll",
         builder =>
         {
-            builder
-                .AllowAnyOrigin()
-                .AllowAnyMethod()
-                .AllowAnyHeader();
+            ;
         });
 });

[Killed] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:73:1
 });
 
 // HttpClient
-builder.Services.AddHttpClient();
+;
 
 var app = builder.Build();
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Post_AuthGoogle_ReturnsBadRequestForInvalidToken

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:85:1
 }
 
 app.UseHttpsRedirection();
-app.UseCors("AllowAll");
+;
 app.UseAuthentication();
 app.UseAuthorization();

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:86:1
 
 app.UseHttpsRedirection();
 app.UseCors("AllowAll");
-app.UseAuthentication();
+;
 app.UseAuthorization();
 app.UseStaticFiles();

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:88:1
 app.UseCors("AllowAll");
 app.UseAuthentication();
 app.UseAuthorization();
-app.UseStaticFiles();
+;
 
 app.MapControllers();

[Survived] Statement mutation
proyecto-si784-2025-i-u3-scaeupt/WebApp/pyWeb_ScaeUPT/Program.cs:93:1
 app.MapControllers();
 
 // Configurar página de inicio
-app.MapFallbackToFile("index.html");
+;
 
 app.Run();
